In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# 删除重复元素
- drop(标签名s, axis)  删除行或列
- dropna(axis) 删除Nan的数据
- drop_duplicates() 删除重复的行
    - duplicated()  查看重复行

In [22]:
df = DataFrame([
    [2000, 1200, 800],
    [1900, 3000, 900],
    [2000, 1200, 800]
], columns=('华为', 'Vivo', '华为'),
    index=('西安', '北京', '成都'))
# df = DataFrame([
#     [2000, 1200, 800],
#     [1900, 3000, 900],
#     [2000, 1200, 800]
# ], columns=('华为', 'Vivo', '华为'))
df

      华为  Vivo   华为
西安  2000  1200  800
北京  1900  3000  900
成都  2000  1200  800

In [4]:
# 删除行
df.drop('成都', axis=0)

      华为  Vivo   华为
西安  2000  1200  800
北京  1900  3000  900

In [10]:
# 按行索引值删除, labels 必须是标签名
# errors {'ignore' , 'raise'} 
# ignore 不抛出异常， raise抛出异常【默认】
df.drop(labels='ok', axis=0, errors='ignore')

      华为  Vivo   华为
西安  2000  1200  800
北京  1900  3000  900
成都  2000  1200  800

In [19]:
# 删除重复的行
# subset 指定列名[唯一的列名] -> pandas低版本的要求
# keep 保持重复行的前行或后行
#   - first 认为第一次出现的重复行，不是重复
#           保留第一次出现的重复行
#   - last 保留最一次出现的重复行
df.duplicated('Vivo', keep='last')

0     True
1    False
2    False
dtype: bool

In [23]:
df.drop_duplicates('Vivo')

      华为  Vivo   华为
西安  2000  1200  800
北京  1900  3000  900

In [25]:
# ? 重复列名的两个列，如何删除某一个列
huawei = df.iloc[:,1]
df.drop('华为', axis=1, inplace=True)
df['华为'] = huawei
df

    Vivo    华为
西安  1200  1200
北京  3000  3000
成都  1200  1200

In [26]:
df.drop_duplicates()

    Vivo    华为
西安  1200  1200
北京  3000  3000

# map映射操作
## replace(原数值， 新数值 )

In [32]:
df

    Vivo    华为
西安  1200  1200
北京  3000  3000
成都  1200  1200

In [33]:
df.replace(1200, 2000)  # 全部替换

    Vivo    华为
西安  2000  2000
北京  3000  3000
成都  2000  2000

In [44]:
df.iloc[0] = None
df

      Vivo      华为
西安     NaN     NaN
北京  3000.0  3000.0
成都  1200.0  1200.0

In [46]:
# df.replace(method='bfill') # 等同于 fillna() 
df.fillna(1000)  # 处理None、NaN

      Vivo      华为
西安  1000.0  1000.0
北京  3000.0  3000.0
成都  1200.0  1200.0

In [47]:
## Series的None的replace
s2 = Series(['Disen', 20, None, '西安'])
s2

0    Disen
1       20
2     None
3       西安
dtype: object

In [50]:
# 替换指定 None值， 使用 [None]的写法
s2.replace(to_replace=[None], value='200万')

0    Disen
1       20
2     200万
3       西安
dtype: object

In [51]:
# 使用字典的方式，批量替换 values
s2.replace({'Disen':'Jack', '西安':'北京'})

0    Jack
1      20
2    None
3      北京
dtype: object

In [53]:
df.replace({1200:5000, 3000:9000, None:1000})

      Vivo      华为
西安  1000.0  1000.0
北京  9000.0  9000.0
成都  5000.0  5000.0

In [54]:
s3 = DataFrame(np.random.randint(1, 100, size=(5,5)), columns=tuple('ABCDE'))
s3

    A   B   C   D   E
0  70  44  18  30  57
1  29  61   2  76  28
2  16  54  62  65  66
3  16  88  16  77  93
4  21  39  40  37  77

In [56]:
# 如果to_replace是dict,且value存在值，
#      dict的Key即是列标签，dict的value现有的值
s3.replace({'D':76}, value='战神')

    A   B   C   D   E
0  70  44  18  30  57
1  29  61   2  战神  28
2  16  54  62  65  66
3  16  88  16  77  93
4  21  39  40  37  77

In [57]:
s3.replace({16:20})

    A   B   C   D   E
0  70  44  18  30  57
1  29  61   2  76  28
2  20  54  62  65  66
3  20  88  20  77  93
4  21  39  40  37  77

## map两种写法

In [62]:
s3['level'] = s3['E'].map({
    57:'不及格',
    28:'留级',
    66: '及格',
    93: '优秀',
    77: '良'
})

In [61]:
s3

    A   B   C   D   E level
0  70  44  18  30  57   不及格
1  29  61   2  76  28    留级
2  16  54  62  65  66   NaN
3  16  88  16  77  93    优秀
4  21  39  40  37  77     良

In [63]:
def covert_level(item):
    if item >= 60:
        return '及格'
    return '留级'

s3['statue'] = s3['D'].map(covert_level)
s3

    A   B   C   D   E level statue
0  70  44  18  30  57   不及格     留级
1  29  61   2  76  28    留级     及格
2  16  54  62  65  66    及格     及格
3  16  88  16  77  93    优秀     及格
4  21  39  40  37  77     良     留级